In [4]:
import pandas as pd
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [5]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], 
              index=['Person', 'Who'])
s

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [7]:
scientists = pd.DataFrame({
    'Name':['Rosaline Franklin', 'William Gosset'],
    'Occupation': ['Chemist','’Statistician'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]})
scientists

                Name     Occupation        Born        Died  Age
0  Rosaline Franklin        Chemist  1920-07-25  1958-04-16   37
1     William Gosset  ’Statistician  1876-06-13  1937-10-16   61

In [8]:
scientists=pd.DataFrame(
    data={'Occupation': ['Chemist','’Statistician'],
        'Born':['1920-07-25','1876-06-13'],
        'Died':['1958-04-16','1937-10-16'],
        'Age':[37,61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation','Born','Died','Age'])
scientists

                      Occupation        Born        Died  Age
Rosaline Franklin        Chemist  1920-07-25  1958-04-16   37
William Gosset     ’Statistician  1876-06-13  1937-10-16   61

In [10]:
first_row = scientists.loc['William Gosset']
print(type(first_row))
first_row

<class 'pandas.core.series.Series'>

Occupation    ’Statistician
Born             1876-06-13
Died             1937-10-16
Age                      61
Name: William Gosset, dtype: object

In [11]:
first_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [12]:
first_row.values

array(['’Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

In [13]:
first_row.keys()

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [18]:
first_row.index[0]

'Occupation'

In [17]:
first_row.keys()[0]

'Occupation'

In [19]:
ages = scientists['Age']
ages

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [21]:
ages.mean()

49.0

In [22]:
ages.min()

37

In [23]:
ages.max()

61

In [24]:
ages.std()

16.97056274847714

In [5]:
scientists = pd.read_csv('pandas_for_everyone\data\scientists.csv')

In [37]:
ages = scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [38]:
ages.mean()

59.125

In [39]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [42]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [47]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [44]:
type(ages > ages.mean())

pandas.core.series.Series

In [48]:
bool_values = [True, True, False, False, True, True, False, False]
ages[bool_values]

0    37
1    61
4    56
5    45
Name: Age, dtype: int64

In [49]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [50]:
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [52]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [53]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [54]:
ages + pd.Series([1, 100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [64]:
rev_ages = ages.sort_index(ascending = False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [65]:
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [67]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [86]:
first_half = scientists[: 4] 
first_half

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [87]:
second_half = scientists[4:]
second_half

            Name        Born        Died  Age          Occupation
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5      John Snow  1813-03-15  1858-06-16   45           Physician
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [88]:
first_half + second_half

  Name Born Died  Age Occupation
0  NaN  NaN  NaN  NaN        NaN
1  NaN  NaN  NaN  NaN        NaN
2  NaN  NaN  NaN  NaN        NaN
3  NaN  NaN  NaN  NaN        NaN
4  NaN  NaN  NaN  NaN        NaN
5  NaN  NaN  NaN  NaN        NaN
6  NaN  NaN  NaN  NaN        NaN
7  NaN  NaN  NaN  NaN        NaN

In [6]:
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [7]:
scientists['Born'].dtype

dtype('O')

In [8]:
scientists['Died'].dtype

dtype('O')

In [12]:
born_datetime = pd.to_datetime(scientists['Born'], format = '%Y-%m-%d')
died_datetime = pd.to_datetime(scientists['Died'], format = '%Y-%m-%d')
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [13]:
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [15]:
scientists.shape

(8, 7)

In [26]:
import random
random.seed(42)
random.shuffle(scientists['Age'])
scientists['age_day_dt'] = scientists['died_dt'] - scientists['born_dt']
scientists['age_year_dt'] = scientists['age_dt'].astype('timedelta64[Y]')
scientists

D:\anaconda3\lib\random.py:307: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_dt,age_day_dt,age_year_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,61,Chemist,1920-07-25,1958-04-16,13779 days,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,41,Statistician,1876-06-13,1937-10-16,22404 days,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,66,Nurse,1820-05-12,1910-08-13,32964 days,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,56,Chemist,1867-11-07,1934-07-04,24345 days,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,37,Biologist,1907-05-27,1964-04-14,20777 days,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,77,Computer Scientist,1912-06-23,1954-06-07,15324 days,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,90,Mathematician,1777-04-30,1855-02-23,28422 days,28422 days,77.0

In [35]:
names = scientists['Name']
names.to_pickle('pandas_for_everyone\output\scientists_names.pickle')
scientists_names_from_pickle = pd.read_pickle('pandas_for_everyone\output\scientists_names.pickle')
scientists_names_from_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [36]:
names.to_csv('pandas_for_everyone\output\scientists_names.csv')
scientists.to_csv('pandas_for_everyone\output\scientists_df.tsv', sep='\t')
scientists.to_csv('pandas_for_everyone\output\scientists_df_no_index.csv', index=False)

In [37]:
names_df = names.to_frame()
names_df.to_excel('pandas_for_everyone\output\scientists_names_df.xls')
names_df.to_excel('pandas_for_everyone\output\scientists_names_df.xlsx')

<ipython-input-37-e3354b679250>:2: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('pandas_for_everyone\output\scientists_names_df.xls')

In [38]:
scientists.to_excel('pandas_for_everyone\output\scientists_df.xlsx',
                   sheet_name='scientists', index=False)